# DeleteLBColumn

## Description
Deletes a column from the specified list browser control.

```pascal
FUNCTION DeleteLBColumn(
				dialogID    : LONGINT;
				componentID : LONGINT;
				columnIndex : INTEGER): BOOLEAN;
```

```python
def vs.DeleteLBColumn(dialogID, componentID, columnIndex):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|
|columnIndex|INTEGER|index of the column to be deleted|

## Version
Availability: from VectorWorks11.0

## Category
* Dialogs - Modern - Browser